# スタート表示用

# tellrow表示
execute as @a run tellraw @s [{"selector":"@s"}, {"text":"さん\nルールを守れば"}, {"text": "”なんでもあり”", "color": "red"}, {"text":"のサバイバルPVPへようこそ"}]

# 全体ルール
tellraw @a "- 高所では、寒さによりデバフが付与されます。水・マグマは凍ります"
tellraw @a "- 黒曜石は自動削除されます"
tellraw @a "- 死人に口なしの法則より死亡時以降の会話の禁止(別VCに移動)"
tellraw @a "- チート、プラグイン、コマンド、ハッキング、負荷攻撃の禁止"
tellraw @a "- ゲーム世界以外へ影響の及ぶ約束事や交換条件の禁止"
tellraw @a "- チャット欄の荒らし、全体に支障をきたすような行為、嘘、虚言の禁止"
# チーム戦ルール
tellraw @a "- チーム戦の場合、チームに対する直接的な利敵行為の禁止"
tellraw @a "- チーム戦の場合、敵チームVCへの移動の禁止"